In [1]:
import numpy as np
import pandas as pd

In [ ]:
Creation of Dataframes

In [3]:
data = {
    "Name" : ["loki","rawat","lucky"],
    "Age"  : [19,20,25],
    "city" : ["new york","california","paris"],
    "salary" : [10000000,30000000,5000000000]
}
pd.DataFrame(data)

    Name  Age        city      salary
0   loki   19    new york    10000000
1  rawat   20  california    30000000
2  lucky   25       paris  5000000000

In [51]:
my_data = [
     ["loki",19,"new york"],
     ["rawat",20,"california"],
     ["lucky",25,"paris"],
     
]
def2 = pd.DataFrame(my_data)
columns = ["name","age","city"]
def2 = pd.DataFrame(my_data,columns = columns)
def2

    name age        city
0   loki  19    new york
1  rawat  20  california
2  lucky  25       paris

Selection And Indexing Of Column

In [53]:
def2

    name age        city
0   loki  19    new york
1  rawat  20  california
2  lucky  25       paris

In [54]:
def2['name']

0     loki
1    rawat
2    lucky
Name: name, dtype: object

In [55]:
def2[["name","city"]]

    name        city
0   loki    new york
1  rawat  california
2  lucky       paris

Creating A New Column

In [58]:
def2["designation"] = ["engineer","footballer","rich"]
def2

    name age        city designation
0   loki  19    new york    engineer
1  rawat  20  california  footballer
2  lucky  25       paris        rich

Removing a column

In [59]:
def2.drop('designation',axis = 1)

    name age        city
0   loki  19    new york
1  rawat  20  california
2  lucky  25       paris

In [60]:
def2

    name age        city designation
0   loki  19    new york    engineer
1  rawat  20  california  footballer
2  lucky  25       paris        rich

In [61]:
def2.drop('designation',axis=1,inplace = True)

In [62]:
def2

    name age        city
0   loki  19    new york
1  rawat  20  california
2  lucky  25       paris

Selecting A Row

In [63]:
def2.loc[0]

name        loki
age           19
city    new york
Name: 0, dtype: object

In [64]:
def2.loc[[0,1]]

    name age        city
0   loki  19    new york
1  rawat  20  california

Selecting Subset Of Rows And Columns

In [65]:
def2.loc[[0,1]]

    name age        city
0   loki  19    new york
1  rawat  20  california

In [66]:
def2.loc[[0,1]][["age","city"]]

  age        city
0  19    new york
1  20  california

Condition Statement

In [70]:
def2

    name age        city
0   loki  19    new york
1  rawat  20  california
2  lucky  25       paris

In [86]:
def2['age'] = pd.to_numeric(def2['age'], errors='coerce')  # Convert to numeric, invalid values become NaN
def2[def2['age'] > 19]  # Now we can compare numeric values

    name  age        city
1  rawat   20  california
2  lucky   25       paris

In [87]:
def2[(def2['age'] > 19) & (def2['city'] == 'paris')]

    name  age   city
2  lucky   25  paris